scripts/jmeter.log
2016/01/28 18:05:05 INFO  - jmeter.util.JMeterUtils: Setting Locale to en_US 
2016/01/28 18:05:05 INFO  - jmeter.JMeter: Loading user properties from: /usr/local/Cellar/jmeter/2.13/libexec/bin/user.properties 
2016/01/28 18:05:05 INFO  - jmeter.JMeter: Loading system properties from: /usr/local/Cellar/jmeter/2.13/libexec/bin/system.properties 
2016/01/28 18:05:06 INFO  - jmeter.JMeter: Copyright (c) 1998-2015 The Apache Software Foundation 
2016/01/28 18:05:06 INFO  - jmeter.JMeter: Version 2.13 r1665067 
2016/01/28 18:05:06 INFO  - jmeter.JMeter: java.version=1.7.0_67 
2016/01/28 18:05:06 INFO  - jmeter.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM 
2016/01/28 18:05:06 INFO  - jmeter.JMeter: os.name=Mac OS X 
2016/01/28 18:05:06 INFO  - jmeter.JMeter: os.arch=x86_64 
2016/01/28 18:05:06 INFO  - jmeter.JMeter: os.version=10.11.1 
2016/01/28 18:05:06 INFO  - jmeter.JMeter: file.encoding=UTF-8 
2016/01/28 18:05:06 INFO  - jmeter.JMeter: Default Locale=English (United States) 
2016/01/28 18:05:06 INFO  - jmeter.JMeter: JMeter  Locale=English (United States) 
2016/01/28 18:05:06 INFO  - jmeter.JMeter: JMeterHome=/usr/local/Cellar/jmeter/2.13/libexec 
2016/01/28 18:05:06 INFO  - jmeter.JMeter: user.dir  =/Users/zabilcm/projects/performance 
2016/01/28 18:05:06 INFO  - jmeter.JMeter: PWD       =/Users/zabilcm/projects/performance 
2016/01/28 18:05:06 INFO  - jmeter.JMeter: IP: 10.4.21.147 Name: ok-computer.local FullName: 10.4.21.147 
2016/01/28 18:05:06 INFO  - jmeter.services.FileServer: Default base='/Users/zabilcm/projects/performance' 
2016/01/28 18:05:06 INFO  - jmeter.services.FileServer: Set new base='/Users/zabilcm/projects/performance' 
2016/01/28 18:05:06 INFO  - jmeter.save.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2 
2016/01/28 18:05:06 INFO  - jmeter.save.SaveService: Using SaveService properties file encoding UTF-8 
2016/01/28 18:05:06 INFO  - jmeter.save.SaveService: Using SaveService properties file version 1656252 
2016/01/28 18:05:06 INFO  - jmeter.save.SaveService: Using SaveService properties version 2.8 
2016/01/28 18:05:06 INFO  - jmeter.save.SaveService: All converter versions present and correct 
2016/01/28 18:05:06 INFO  - jmeter.save.SaveService: Loading file: jmeter.jmx 
2016/01/28 18:05:06 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Cannot find .className property for htmlParser, using default 
2016/01/28 18:05:06 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for text/html is  
2016/01/28 18:05:06 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for application/xhtml+xml is  
2016/01/28 18:05:06 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for application/xml is  
2016/01/28 18:05:06 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for text/xml is  
2016/01/28 18:05:06 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser 
2016/01/28 18:05:06 INFO  - jmeter.JMeter: Creating summariser <summary> 
2016/01/28 18:05:06 INFO  - jmeter.engine.StandardJMeterEngine: Listeners will be started after enabling running version 
2016/01/28 18:05:06 INFO  - jmeter.engine.StandardJMeterEngine: To revert to the earlier behaviour, define jmeterengine.startlistenerslater=false 
2016/01/28 18:05:06 INFO  - jmeter.engine.StandardJMeterEngine: Running the test! 
2016/01/28 18:05:06 INFO  - jmeter.samplers.SampleEvent: List of sample_variables: [uuid] 
2016/01/28 18:05:06 INFO  - jmeter.samplers.SampleEvent: List of sample_variables: [uuid] 
2016/01/28 18:05:06 INFO  - jmeter.engine.util.CompoundVariable: Note: Function class names must contain the string: '.functions.' 
2016/01/28 18:05:06 INFO  - jmeter.engine.util.CompoundVariable: Note: Function class names must not contain the string: '.gui.' 
2016/01/28 18:05:06 INFO  - jmeter.JMeter: Running test (1453984506702) 
2016/01/28 18:05:06 INFO  - jmeter.engine.StandardJMeterEngine: Starting ThreadGroup: 1 : ThreadGroup 
2016/01/28 18:05:06 INFO  - jmeter.engine.StandardJMeterEngine: Starting 10 threads for group ThreadGroup. 
2016/01/28 18:05:06 INFO  - jmeter.engine.StandardJMeterEngine: Thread will continue on error 
2016/01/28 18:05:06 INFO  - jmeter.threads.ThreadGroup: Starting thread group number 1 threads 10 ramp-up 5 perThread 500.0 delayedStart=true 
2016/01/28 18:05:06 INFO  - jmeter.threads.ThreadGroup: Started thread group number 1 
2016/01/28 18:05:06 INFO  - jmeter.engine.StandardJMeterEngine: All thread groups have been started 
2016/01/28 18:05:06 INFO  - jmeter.threads.JMeterThread: jmeterthread.startearlier=true (see jmeter.properties) 
2016/01/28 18:05:06 INFO  - jmeter.threads.JMeterThread: Running PostProcessors in forward order 
2016/01/28 18:05:06 INFO  - jmeter.threads.JMeterThread: Thread started: ThreadGroup 1-1 
2016/01/28 18:05:06 INFO  - jmeter.protocol.http.sampler.HTTPHCAbstractImpl: Local host = ok-computer.local 
2016/01/28 18:05:06 INFO  - jmeter.protocol.http.sampler.HTTPHC4Impl: HTTP request retry count = 0 
2016/01/28 18:05:06 INFO  - jmeter.protocol.http.sampler.HTTPHC4Impl: Setting up HTTPS TrustAll scheme 
2016/01/28 18:05:06 INFO  - jmeter.util.JsseSSLManager: Using default SSL protocol: TLS 
2016/01/28 18:05:06 INFO  - jmeter.util.JsseSSLManager: SSL session context: per-thread 
2016/01/28 18:05:06 INFO  - jmeter.samplers.SampleResult: Note: Sample TimeStamps are START times 
2016/01/28 18:05:06 INFO  - jmeter.samplers.SampleResult: sampleresult.default.encoding is set to ISO-8859-1 
2016/01/28 18:05:06 INFO  - jmeter.samplers.SampleResult: sampleresult.useNanoTime=true 
2016/01/28 18:05:06 INFO  - jmeter.samplers.SampleResult: sampleresult.nanoThreadSleep=5000 
2016/01/28 18:05:07 INFO  - jmeter.threads.JMeterThread: Thread started: ThreadGroup 1-2 
2016/01/28 18:05:07 INFO  - jmeter.threads.JMeterThread: Thread started: ThreadGroup 1-3 
2016/01/28 18:05:08 INFO  - jmeter.threads.JMeterThread: Thread started: ThreadGroup 1-4 
2016/01/28 18:05:08 INFO  - jmeter.threads.JMeterThread: Thread started: ThreadGroup 1-5 
2016/01/28 18:05:09 INFO  - jmeter.threads.JMeterThread: Thread started: ThreadGroup 1-6 
2016/01/28 18:05:09 INFO  - jmeter.threads.JMeterThread: Thread started: ThreadGroup 1-7 
2016/01/28 18:05:10 INFO  - jmeter.threads.JMeterThread: Thread started: ThreadGroup 1-8 
2016/01/28 18:05:10 INFO  - jmeter.threads.JMeterThread: Thread started: ThreadGroup 1-9 
2016/01/28 18:05:11 INFO  - jmeter.threads.JMeterThread: Thread started: ThreadGroup 1-10 
2016/01/28 18:05:30 INFO  - jmeter.reporters.Summariser: summary +   5464 in  23.3s =  234.5/s Avg:    37 Min:     8 Max:   372 Err:     0 (0.00%) Active: 10 Started: 10 Finished: 0 
2016/01/28 18:06:00 INFO  - jmeter.reporters.Summariser: summary +   8704 in    30s =  290.1/s Avg:    34 Min:     7 Max:   281 Err:     0 (0.00%) Active: 10 Started: 10 Finished: 0 
2016/01/28 18:06:00 INFO  - jmeter.reporters.Summariser: summary =  14168 in  53.3s =  265.8/s Avg:    35 Min:     7 Max:   372 Err:     0 (0.00%) 
2016/01/28 18:06:06 INFO  - jmeter.threads.JMeterThread: Stopping because end time detected by thread: ThreadGroup 1-3 
2016/01/28 18:06:06 INFO  - jmeter.threads.JMeterThread: Stopping because end time detected by thread: ThreadGroup 1-4 
2016/01/28 18:06:06 INFO  - jmeter.threads.JMeterThread: Thread finished: ThreadGroup 1-3 
2016/01/28 18:06:06 INFO  - jmeter.threads.JMeterThread: Thread finished: ThreadGroup 1-4 
2016/01/28 18:06:06 INFO  - jmeter.threads.JMeterThread: Stopping because end time detected by thread: ThreadGroup 1-6 
2016/01/28 18:06:06 INFO  - jmeter.threads.JMeterThread: Thread finished: ThreadGroup 1-6 
2016/01/28 18:06:06 INFO  - jmeter.threads.JMeterThread: Stopping because end time detected by thread: ThreadGroup 1-2 
2016/01/28 18:06:06 INFO  - jmeter.threads.JMeterThread: Thread finished: ThreadGroup 1-2 
2016/01/28 18:06:06 INFO  - jmeter.threads.JMeterThread: Stopping because end time detected by thread: ThreadGroup 1-8 
2016/01/28 18:06:06 INFO  - jmeter.threads.JMeterThread: Thread finished: ThreadGroup 1-8 
2016/01/28 18:06:06 INFO  - jmeter.threads.JMeterThread: Stopping because end time detected by thread: ThreadGroup 1-10 
2016/01/28 18:06:06 INFO  - jmeter.threads.JMeterThread: Thread finished: ThreadGroup 1-10 
2016/01/28 18:06:06 INFO  - jmeter.threads.JMeterThread: Stopping because end time detected by thread: ThreadGroup 1-1 
2016/01/28 18:06:06 INFO  - jmeter.threads.JMeterThread: Thread finished: ThreadGroup 1-1 
2016/01/28 18:06:06 INFO  - jmeter.threads.JMeterThread: Stopping because end time detected by thread: ThreadGroup 1-5 
2016/01/28 18:06:06 INFO  - jmeter.threads.JMeterThread: Thread finished: ThreadGroup 1-5 
2016/01/28 18:06:06 INFO  - jmeter.threads.JMeterThread: Stopping because end time detected by thread: ThreadGroup 1-9 
2016/01/28 18:06:06 INFO  - jmeter.threads.JMeterThread: Thread finished: ThreadGroup 1-9 
2016/01/28 18:06:06 INFO  - jmeter.threads.JMeterThread: Stopping because end time detected by thread: ThreadGroup 1-7 
2016/01/28 18:06:06 INFO  - jmeter.threads.JMeterThread: Thread finished: ThreadGroup 1-7 
2016/01/28 18:06:06 INFO  - jmeter.engine.StandardJMeterEngine: Notifying test listeners of end of test 
2016/01/28 18:06:06 INFO  - jmeter.reporters.Summariser: summary +   2368 in     7s =  350.6/s Avg:    28 Min:     7 Max:   225 Err:     0 (0.00%) Active: 0 Started: 10 Finished: 10 
2016/01/28 18:06:06 INFO  - jmeter.reporters.Summariser: summary =  16536 in  60.1s =  275.4/s Avg:    34 Min:     7 Max:   372 Err:     0 (0.00%)